/*算術演算子を使用して計算してみよう*/

/*1.合計点数を算出してください*/
const test = {
  国語: 100, 数学: 80, 英語: 75, 理科: 70, 社会: 80
};
let sum = 0;

for (let hoge in test) {
  sum += test[hoge];
}
console.log(sum);

/*2.引き算を使用して計算してください*/
console.log(100000 - 80000);

/*3.掛け算を使用して計算してください*/
console.log(32 * 64);

/*4.割り算を使用して計算してください*/
console.log(10 / 2);

/*5.インクリメント演算子を使用してください*/
let num = 3;
num += 1;
console.log(num);

/*6.デクリメント演算子を使用してください*/
let number = 0;
number -= 1;
console.log(number);

/**/

/**/

/**/

/**/

/**/

/**/

/**/

/**/

/**/

/**/

/**/

/**/

/**/

/**/

/**/

/**/

/**/

/**/

/**/

/**/

/**/

/**/